Tekla Open API Reference for Tekla Structures 2025
DrawingObject Class
 The DrawingObject class is an abstract base class for all the objects in the drawing. All drawing objects have a database identifier and belong to some view.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 More...
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class DrawingObject : DatabaseObject,
	IIsEqual, IRelatedObjects
<SerializableAttribute>
Public MustInherit Class DrawingObject
	Inherits DatabaseObject
	Implements IIsEqual, IRelatedObjects
The DrawingObject type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the attributes of the current object. Only attributes of the same type as the object are allowed.
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
Methods
Name | Description
Delete
 Deletes the instance from the database.
 (Inherited from DatabaseObject.)
GetDoubleUserProperties(Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDoubleUserProperties(List<String>, Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDrawing
 Gets the drawing where the drawing object is.
GetIntegerUserProperties(Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetIntegerUserProperties(List<String>, Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetRelatedObjects()
 Gets the related objects of the current object.
GetRelatedObjects(Type[])
 Gets the related objects of the current object that are of certain types.
GetStringUserProperties(Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetStringUserProperties(List<String>, Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Double)
 Gets a double property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Int32)
 Gets an integer property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, String)
 Gets a string property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetView
 Gets the view where the drawing object is.
Insert
 Inserts the object instance into the database. The inserted instance must be of a real type.
 (Inherited from DatabaseObject.)
IsEqual
 Compares the current object with the given object. Checks every field of both objects for equality.
IsSameDatabaseObject
 Returns true if the current object and the given object are referencing the same database object.
 (Inherited from DatabaseObject.)
Modify
 Modifies the instance in the database.
 (Inherited from DatabaseObject.)
Select
 Selects the object instance from the database.
 (Inherited from DatabaseObject.)
SetUserProperty(String, Double)
 Sets a double property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, Int32)
 Sets an integer property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, String)
 Sets a string property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
ToString
 Changes the string presentation of the drawing object.
 (Overrides Object.ToString().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DetailMark
 Tekla.Structures.Drawing.DimensionBase
 Tekla.Structures.Drawing.DimensionLink
 Tekla.Structures.Drawing.DimensionSetBase
 Tekla.Structures.Drawing.EmbeddedObjectBase
 Tekla.Structures.Drawing.GraphicObject
 Tekla.Structures.Drawing.LeaderLine
 Tekla.Structures.Drawing.LevelMark
 Tekla.Structures.Drawing.LinkBase
 Tekla.Structures.Drawing.MarkBase
 Tekla.Structures.Drawing.ModelObject
 Tekla.Structures.Drawing.Plugin
 Tekla.Structures.Drawing.SectionMarkBase
 Tekla.Structures.Drawing.Symbol
 Tekla.Structures.Drawing.Text
 Tekla.Structures.Drawing.ViewBase
 Tekla.Structures.Drawing.WeldMark